# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8 不同层级预定义锚框
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, CBAM, [1024]],                          # 10
   [-1, 1, Conv, [512, 1, 1]],                    # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 12
   [-1, 1, CBAM, [512]],           # new layer    # 13
   [6, 1, CBAM, [512]],                           # 14
   [[-1, 13], 1, Concat, [1]],  # cat backbone P4 # 15
   [-1, 3, C3, [512, False]],                     # 16

   [-1, 1, Conv, [256, 1, 1]],                    # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 18
   [-1, 1, CBAM, [256]],                          # 19
   [4, 1, CBAM, [256]],                           # 20
   [[-1, 19], 1, Concat, [1]],  # cat backbone P3 # 21
   [-1, 3, C3, [256, False]],  # (P3/8-small)     # 22 output

   [-1, 1, Conv, [256, 3, 2]],                    # 23
   [17, 1, CBAM, [256]],                          # 24
   [[-1, 23], 1, Concat, [1]],      # cat head P4 # 25
   [-1, 3, C3, [512, False]],  # (P4/16-medium)   # 26 output

   [-1, 1, Conv, [512, 3, 2]],                    # 27
   [11, 1, CBAM, [512]],                          # 28
   [[-1, 27], 1, Concat, [1]],      # cat head P5 # 29
   [-1, 3, C3, [1024, False]],  # (P5/32-large)   # 30 output

   [[22, 26, 30], 1, Detect, [nc, anchors]],  # Detect
  ]
